DevOpsOfChaos/esp32-smart-home/firmware/src/master/main.cpp
/*
====================================================================
 Projekt   : SmartHome ESP32
 Geraet    : Master (ESP32-C3)
 Datei     : main.cpp
 Version   : 0.2.2
 Stand     : 2026-03-10

 Funktion:
 Feste Firmware-Basis fuer vier bekannte Basisgeraete:
 - net_erl_01
 - net_zrl_01
 - net_sen_01
 - bat_sen_01

 Dieser Stand erweitert die reale Minimalstrecke kontrolliert:
 - HELLO / HELLO_ACK / HEARTBEAT fuer alle vier Basisgeraete
 - STATE_REPORT fuer Relais-, Sensor- und Batterie-Basis
 - EVENT-Weitergabe fuer eventfaehige Basen
 - MQTT Topics gemaess docs/04_mqtt_topics.md
 - Keine offene Mehrgeraete-Architektur und keine Sonderlogik je Endgeraet
====================================================================
*/

#include <Arduino.h>
#include <WiFi.h>
#include <PubSubClient.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <stdarg.h>
#include <string.h>
#include <ctype.h>
#include <stdlib.h>
#include <limits.h>

#if __has_include(<esp_arduino_version.h>)
  #include <esp_arduino_version.h>
#endif

#ifndef ESP_ARDUINO_VERSION_MAJOR
  #define ESP_ARDUINO_VERSION_MAJOR 2
#endif

#include "AppConfig.h"
#include "PinConfig.h"
#include "../../include/ProjectVersion.h"
#include "../../include/DebugConfig.h"
#include "../../lib/ShProtocol/src/Protocol.h"
#include "../../lib/ShProtocol/src/DeviceTypes.h"

#if __has_include("../../include/Secrets.h")
  #include "../../include/Secrets.h"
#else
  #warning "Keine Secrets.h gefunden. Bitte aus Secrets.example.h erstellen."
  #define WIFI_SSID         "KEIN_SSID"
  #define WIFI_PASSWORD     "KEIN_PASSWORT"
  #define MQTT_HOST         "127.0.0.1"
  #define MQTT_PORT         1883
  #define MQTT_USER         "mqtt_user"
  #define MQTT_PASSWORD     "KEIN_MQTT_PASSWORT"
#endif

constexpr bool DEBUG_LOKAL_AKTIV = DEVICE_DEBUG_AKTIV && DEBUG_AKTIV;
constexpr char DATEI_GERAET[] = "MASTER";
constexpr char DATEI_VERSION[] = "0.2.2";
constexpr char MQTT_TOPIC_CMD_SET_SUB[] = "smarthome/node/+/cmd/set";
constexpr char MQTT_TOPIC_CMD_GET_SUB[] = "smarthome/node/+/cmd/get";
constexpr uint8_t WINDOW_STATE_UNKNOWN = 0xFFU;

struct NodeDefinition {
    const char* node_id;
    const char* device_type;
    uint8_t device_class;
    uint8_t power_type;
    unsigned long offline_timeout_ms;
};

struct NodeRuntime {
    bool meta_bekannt;
    bool online;
    bool state_bekannt;
    bool mac_bekannt;
    bool fault;
    bool relay_1;
    bool relay_2;
    bool cover_mode;
    uint8_t cover_state;
    uint8_t cover_position;
    int16_t temp_01c;
    uint16_t hum_01pct;
    uint16_t lux;
    bool motion;
    uint8_t battery_pct;
    uint16_t battery_mv;
    uint8_t window_open;
    uint16_t rain_raw;
    uint8_t button_flags;
    uint32_t uptime_s;
    uint16_t caps;
    uint16_t fw_version;
    char device_name[SH_DEVICE_NAME_LEN];
    uint8_t mac[6];
    unsigned long letzter_kontakt_ms;
};

struct MasterState {
    bool wlan_verbunden;
    bool mqtt_verbunden;
    bool espnow_bereit;
    unsigned long letzter_wlan_versuch_ms;
    unsigned long letzter_mqtt_versuch_ms;
    uint8_t naechste_seq;
};

constexpr NodeDefinition NODE_DEFINITIONS[] = {
    {"net_erl_01", "net_erl", SH_CLASS_NET_ERL, SH_POWER_MAINS, NODE_OFFLINE_TIMEOUT_MS},
    {"net_zrl_01", "net_zrl", SH_CLASS_NET_ZRL, SH_POWER_MAINS, NODE_OFFLINE_TIMEOUT_MS},
    {"net_sen_01", "net_sen", SH_CLASS_NET_SEN, SH_POWER_MAINS, NODE_OFFLINE_TIMEOUT_MS},
    {"bat_sen_01", "bat_sen", SH_CLASS_BAT_SEN, SH_POWER_BATTERY, BATTERY_NODE_OFFLINE_TIMEOUT_MS},
};

constexpr size_t NODE_COUNT = sizeof(NODE_DEFINITIONS) / sizeof(NODE_DEFINITIONS[0]);

WiFiClient wifiClient;
PubSubClient mqttClient(wifiClient);
MasterState masterStatus = {};
NodeRuntime nodeStates[NODE_COUNT] = {};

void logf(const char* level, const char* format, ...) {
    if (!DEBUG_LOKAL_AKTIV) return;

    char message[224];
    va_list args;
    va_start(args, format);
    vsnprintf(message, sizeof(message), format, args);
    va_end(args);

    Serial.print("[");
    Serial.print(level);
    Serial.print("] ");
    Serial.println(message);
}

void copyText(char* target, size_t targetSize, const char* source) {
    if (!target || targetSize == 0U) return;
    if (!source) {
        target[0] = '\0';
        return;
    }

    strncpy(target, source, targetSize - 1U);
    target[targetSize - 1U] = '\0';
}

void macText(const uint8_t* mac, char* buffer, size_t bufferSize) {
    if (!buffer || bufferSize == 0U) return;
    if (!mac) {
        copyText(buffer, bufferSize, "unbekannt");
        return;
    }

    char local[18] = {0};
    SmartHome::macToString(mac, local);
    copyText(buffer, bufferSize, local);
}

const char* powerTypeText(uint8_t powerType) {
    return powerType == SH_POWER_BATTERY ? "battery" : "mains";
}

const char* eventTypeText(uint8_t eventType) {
    switch (eventType) {
        case SH_EVENT_BUTTON_PRESS: return "button_press";
        case SH_EVENT_MOTION_DETECTED: return "motion_detected";
        case SH_EVENT_WINDOW_OPENED: return "window_opened";
        case SH_EVENT_WINDOW_CLOSED: return "window_closed";
        case SH_EVENT_RAIN_DETECTED: return "rain_detected";
        case SH_EVENT_RELAY_CHANGED: return "relay_changed";
        case SH_EVENT_LIGHT_AUTO_ON: return "light_auto_on";
        case SH_EVENT_LIGHT_AUTO_OFF: return "light_auto_off";
        case SH_EVENT_COVER_UP: return "cover_up";
        case SH_EVENT_COVER_DOWN: return "cover_down";
        case SH_EVENT_COVER_STOP: return "cover_stop";
        case SH_EVENT_NODE_BOOT: return "node_boot";
        case SH_EVENT_SENSOR_FAULT: return "sensor_fault";
        case SH_EVENT_COMM_FAULT: return "comm_fault";
        default: return "unknown";
    }
}

void schreibeIntOrNull(char* buffer, size_t bufferSize, long value, long invalidValue) {
    if (value == invalidValue) {
        copyText(buffer, bufferSize, "null");
        return;
    }
    snprintf(buffer, bufferSize, "%ld", value);
}

void schreibeUIntOrNull(char* buffer, size_t bufferSize, unsigned long value, unsigned long invalidValue) {
    if (value == invalidValue) {
        copyText(buffer, bufferSize, "null");
        return;
    }
    snprintf(buffer, bufferSize, "%lu", value);
}

