DevOpsOfChaos/esp32-smart-home/firmware/src/master/main.cpp
void baueMasterTopic(char* buffer, size_t bufferSize) {
    snprintf(buffer, bufferSize, "smarthome/master/%s/status", DEVICE_ID);
}

void baueNodeTopic(size_t nodeIndex, const char* suffix, char* buffer, size_t bufferSize) {
    snprintf(buffer, bufferSize, "smarthome/node/%s/%s", NODE_DEFINITIONS[nodeIndex].node_id, suffix);
}

void initialisiereNodeStates() {
    for (size_t i = 0; i < NODE_COUNT; ++i) {
        nodeStates[i] = {};
        nodeStates[i].cover_state = SH_COVER_STATE_STOPPED;
        nodeStates[i].cover_position = 0xFFU;
        nodeStates[i].temp_01c = INT16_MIN;
        nodeStates[i].hum_01pct = 0xFFFFU;
        nodeStates[i].lux = 0xFFFFU;
        nodeStates[i].battery_pct = 0xFFU;
        nodeStates[i].window_open = WINDOW_STATE_UNKNOWN;
        nodeStates[i].rain_raw = 0xFFFFU;
        copyText(nodeStates[i].device_name, sizeof(nodeStates[i].device_name), NODE_DEFINITIONS[i].device_type);
    }
}

int findeNodeIndex(const char* nodeId) {
    if (!nodeId) return -1;

    for (size_t i = 0; i < NODE_COUNT; ++i) {
        if (strncmp(nodeId, NODE_DEFINITIONS[i].node_id, SH_DEVICE_ID_LEN) == 0) {
            return (int)i;
        }
    }

    return -1;
}

bool istRelayNode(size_t nodeIndex) {
    return NODE_DEFINITIONS[nodeIndex].device_class == SH_CLASS_NET_ERL ||
           NODE_DEFINITIONS[nodeIndex].device_class == SH_CLASS_NET_ZRL;
}

uint16_t holeHelloCaps(const SmartHome::HelloPayload& payload) {
    return (uint16_t)(((uint16_t)payload.caps_hi << 8) | payload.caps_lo);
}

bool stellePeerSicher(const uint8_t* mac) {
    if (mac == nullptr || !SmartHome::isValidMac(mac)) return false;
    if (esp_now_is_peer_exist(mac)) return true;

    esp_now_peer_info_t peerInfo = {};
    memcpy(peerInfo.peer_addr, mac, 6);
    peerInfo.channel = (uint8_t)WLAN_KANAL;
    peerInfo.encrypt = false;

    esp_err_t err = esp_now_add_peer(&peerInfo);
    if (err != ESP_OK) {
        logf("WARN", "Peer konnte nicht angelegt werden (err=%d)", (int)err);
        return false;
    }

    char text[18] = {0};
    macText(mac, text, sizeof(text));
    logf("INFO", "Peer aktiv: %s", text);
    return true;
}

bool sendePaket(const uint8_t* zielMac, uint8_t msgType, const void* payload, size_t payloadLen, const char* label) {
    if (zielMac == nullptr || payloadLen > SH_MAX_PAYLOAD_BYTES) return false;
    if (!stellePeerSicher(zielMac)) return false;

    uint8_t buffer[SH_ESPNOW_MAX_BYTES] = {0};
    SmartHome::MsgHeader header = {};
    SmartHome::fillHeader(header, msgType, masterStatus.naechste_seq++, 0, (uint16_t)payloadLen);

    uint8_t* payloadBuffer = buffer + SH_HEADER_SIZE;
    if (payloadLen > 0U && payload != nullptr) {
        memcpy(payloadBuffer, payload, payloadLen);
    }

    SmartHome::finalizePacketCrc(header, payloadBuffer);
    memcpy(buffer, &header, sizeof(header));

    esp_err_t err = esp_now_send(zielMac, buffer, SH_HEADER_SIZE + payloadLen);
    if (err != ESP_OK) {
        logf("WARN", "%s konnte nicht gesendet werden (err=%d)", label, (int)err);
        return false;
    }

    char text[18] = {0};
    macText(zielMac, text, sizeof(text));
    logf("INFO", "%s gesendet an %s", label, text);
    return true;
}

void baueMasterStatusJson(char* buffer, size_t bufferSize, bool online) {
    snprintf(
        buffer,
        bufferSize,
        "{\"master_id\":\"%s\",\"online\":%s,\"wifi\":%s,\"mqtt\":%s,\"espnow\":%s,\"fw\":\"%s\"}",
        DEVICE_ID,
        online ? "true" : "false",
        masterStatus.wlan_verbunden ? "true" : "false",
        masterStatus.mqtt_verbunden ? "true" : "false",
        masterStatus.espnow_bereit ? "true" : "false",
        PROJECT_VERSION);
}

void baueNodeMetaJson(size_t nodeIndex, char* buffer, size_t bufferSize) {
    char macBuffer[18] = {0};
    macText(nodeStates[nodeIndex].mac_bekannt ? nodeStates[nodeIndex].mac : nullptr, macBuffer, sizeof(macBuffer));

    snprintf(
        buffer,
        bufferSize,
        "{\"node_id\":\"%s\",\"device_name\":\"%s\",\"device_type\":\"%s\",\"device_class\":%u,\"power_type\":\"%s\",\"caps\":%u,\"fw_version\":%u,\"mac\":\"%s\"}",
        NODE_DEFINITIONS[nodeIndex].node_id,
        nodeStates[nodeIndex].device_name,
        NODE_DEFINITIONS[nodeIndex].device_type,
        (unsigned)NODE_DEFINITIONS[nodeIndex].device_class,
        powerTypeText(NODE_DEFINITIONS[nodeIndex].power_type),
        (unsigned)nodeStates[nodeIndex].caps,
        (unsigned)nodeStates[nodeIndex].fw_version,
        macBuffer);
}

void baueNodeStatusJson(size_t nodeIndex, char* buffer, size_t bufferSize, bool online) {
    snprintf(
        buffer,
        bufferSize,
        "{\"node_id\":\"%s\",\"online\":%s,\"device_type\":\"%s\",\"power_type\":\"%s\",\"fw\":\"%s\"}",
        NODE_DEFINITIONS[nodeIndex].node_id,
        online ? "true" : "false",
        NODE_DEFINITIONS[nodeIndex].device_type,
        powerTypeText(NODE_DEFINITIONS[nodeIndex].power_type),
        PROJECT_VERSION);
}

void baueNodeStateJson(size_t nodeIndex, char* buffer, size_t bufferSize) {
    char tempText[16] = {0};
    char humText[16] = {0};
    char luxText[16] = {0};
    char batteryPctText[16] = {0};
    char batteryMvText[16] = {0};
    char windowText[16] = {0};
    char rainText[16] = {0};
    char coverPositionText[16] = {0};

    switch (NODE_DEFINITIONS[nodeIndex].device_class) {
        case SH_CLASS_NET_ERL:
            snprintf(
                buffer,
                bufferSize,
                "{\"node_id\":\"%s\",\"relay_1\":%s,\"fault\":%s}",
                NODE_DEFINITIONS[nodeIndex].node_id,
                nodeStates[nodeIndex].relay_1 ? "true" : "false",
                nodeStates[nodeIndex].fault ? "true" : "false");
            return;

        case SH_CLASS_NET_ZRL:
            schreibeUIntOrNull(coverPositionText, sizeof(coverPositionText), nodeStates[nodeIndex].cover_position, 0xFFU);
            snprintf(
                buffer,
                bufferSize,
                "{\"node_id\":\"%s\",\"relay_1\":%s,\"relay_2\":%s,\"cover_mode\":%s,\"cover_state\":%u,\"cover_position\":%s,\"fault\":%s}",
                NODE_DEFINITIONS[nodeIndex].node_id,
                nodeStates[nodeIndex].relay_1 ? "true" : "false",
                nodeStates[nodeIndex].relay_2 ? "true" : "false",
                nodeStates[nodeIndex].cover_mode ? "true" : "false",
                (unsigned)nodeStates[nodeIndex].cover_state,
                coverPositionText,
                nodeStates[nodeIndex].fault ? "true" : "false");
            return;

