DevOpsOfChaos/esp32-smart-home/firmware/src/master/main.cpp
        case SH_CLASS_NET_SEN:
            schreibeIntOrNull(tempText, sizeof(tempText), nodeStates[nodeIndex].temp_01c, INT16_MIN);
            schreibeUIntOrNull(humText, sizeof(humText), nodeStates[nodeIndex].hum_01pct, 0xFFFFU);
            schreibeUIntOrNull(luxText, sizeof(luxText), nodeStates[nodeIndex].lux, 0xFFFFU);
            snprintf(
                buffer,
                bufferSize,
                "{\"node_id\":\"%s\",\"temp_01c\":%s,\"hum_01pct\":%s,\"lux\":%s,\"motion\":%s,\"fault\":%s}",
                NODE_DEFINITIONS[nodeIndex].node_id,
                tempText,
                humText,
                luxText,
                nodeStates[nodeIndex].motion ? "true" : "false",
                nodeStates[nodeIndex].fault ? "true" : "false");
            return;

        case SH_CLASS_BAT_SEN:
            schreibeUIntOrNull(batteryPctText, sizeof(batteryPctText), nodeStates[nodeIndex].battery_pct, 0xFFU);
            schreibeUIntOrNull(batteryMvText, sizeof(batteryMvText), nodeStates[nodeIndex].battery_mv, 0U);
            schreibeUIntOrNull(windowText, sizeof(windowText), nodeStates[nodeIndex].window_open, WINDOW_STATE_UNKNOWN);
            schreibeUIntOrNull(rainText, sizeof(rainText), nodeStates[nodeIndex].rain_raw, 0xFFFFU);
            snprintf(
                buffer,
                bufferSize,
                "{\"node_id\":\"%s\",\"battery_pct\":%s,\"battery_mv\":%s,\"window_open\":%s,\"rain_raw\":%s,\"button_flags\":%u,\"fault\":%s}",
                NODE_DEFINITIONS[nodeIndex].node_id,
                batteryPctText,
                batteryMvText,
                windowText,
                rainText,
                (unsigned)nodeStates[nodeIndex].button_flags,
                nodeStates[nodeIndex].fault ? "true" : "false");
            return;

        default:
            copyText(buffer, bufferSize, "{}");
            return;
    }
}

void baueNodeEventJson(size_t nodeIndex, const SmartHome::EventReportPayload& payload, char* buffer, size_t bufferSize) {
    snprintf(
        buffer,
        bufferSize,
        "{\"node_id\":\"%s\",\"event\":\"%s\",\"event_type\":%u,\"trigger\":%u,\"param1\":%u,\"param2\":%u}",
        NODE_DEFINITIONS[nodeIndex].node_id,
        eventTypeText(payload.event_type),
        (unsigned)payload.event_type,
        (unsigned)payload.trigger,
        (unsigned)payload.param1,
        (unsigned)payload.param2);
}

void publishRetained(const char* topic, const char* payload) {
    if (!masterStatus.mqtt_verbunden) return;

    if (!mqttClient.publish(topic, payload, true)) {
        logf("WARN", "MQTT publish fehlgeschlagen: %s", topic);
        return;
    }

    logf("INFO", "MQTT retained %s -> %s", topic, payload);
}

void publishTransient(const char* topic, const char* payload) {
    if (!masterStatus.mqtt_verbunden) return;

    if (!mqttClient.publish(topic, payload, false)) {
        logf("WARN", "MQTT publish fehlgeschlagen: %s", topic);
        return;
    }

    logf("INFO", "MQTT publish %s -> %s", topic, payload);
}

void publishMasterStatus() {
    char topic[96] = {0};
    char payload[192] = {0};
    baueMasterTopic(topic, sizeof(topic));
    baueMasterStatusJson(payload, sizeof(payload), true);
    publishRetained(topic, payload);
}

void publishNodeMeta(size_t nodeIndex) {
    if (!nodeStates[nodeIndex].meta_bekannt) return;

    char topic[96] = {0};
    char payload[224] = {0};
    baueNodeTopic(nodeIndex, "meta", topic, sizeof(topic));
    baueNodeMetaJson(nodeIndex, payload, sizeof(payload));
    publishRetained(topic, payload);
}

void publishNodeStatus(size_t nodeIndex, bool online) {
    char topic[96] = {0};
    char payload[192] = {0};
    baueNodeTopic(nodeIndex, "status", topic, sizeof(topic));
    baueNodeStatusJson(nodeIndex, payload, sizeof(payload), online);
    publishRetained(topic, payload);
}

void publishNodeState(size_t nodeIndex) {
    if (!nodeStates[nodeIndex].state_bekannt) return;

    char topic[96] = {0};
    char payload[224] = {0};
    baueNodeTopic(nodeIndex, "state", topic, sizeof(topic));
    baueNodeStateJson(nodeIndex, payload, sizeof(payload));
    publishRetained(topic, payload);
}

void publishNodeEvent(size_t nodeIndex, const SmartHome::EventReportPayload& payload) {
    char topic[96] = {0};
    char json[224] = {0};
    baueNodeTopic(nodeIndex, "event", topic, sizeof(topic));
    baueNodeEventJson(nodeIndex, payload, json, sizeof(json));
    publishTransient(topic, json);
}

void publishBekannteNodesNachReconnect() {
    publishMasterStatus();

    for (size_t i = 0; i < NODE_COUNT; ++i) {
        publishNodeMeta(i);
        publishNodeStatus(i, nodeStates[i].online);
        publishNodeState(i);
    }
}

void aktualisiereNodeKontakt(size_t nodeIndex, const uint8_t* mac) {
    nodeStates[nodeIndex].letzter_kontakt_ms = millis();

    if (mac != nullptr) {
        bool neueMac = !nodeStates[nodeIndex].mac_bekannt ||
                       memcmp(nodeStates[nodeIndex].mac, mac, 6) != 0;
        memcpy(nodeStates[nodeIndex].mac, mac, 6);
        nodeStates[nodeIndex].mac_bekannt = true;
        stellePeerSicher(nodeStates[nodeIndex].mac);

        if (neueMac) {
            char text[18] = {0};
            macText(mac, text, sizeof(text));
            logf("INFO", "%s MAC aktualisiert: %s", NODE_DEFINITIONS[nodeIndex].node_id, text);
        }
    }

    if (!nodeStates[nodeIndex].online) {
        nodeStates[nodeIndex].online = true;
        publishNodeStatus(nodeIndex, true);
        logf("INFO", "Node %s ist online", NODE_DEFINITIONS[nodeIndex].node_id);
    }
}

void sendeHelloAck(const uint8_t* zielMac, uint8_t ackStatus) {
    SmartHome::HelloAckPayload payload = {};
    payload.channel = (uint8_t)(masterStatus.wlan_verbunden ? WiFi.channel() : WLAN_KANAL);
    payload.ack_status = ackStatus;
    sendePaket(zielMac, SH_MSG_HELLO_ACK, &payload, sizeof(payload), "HELLO_ACK");
}

bool skipWhitespace(const char*& cursor) {
    if (cursor == nullptr) return false;
    while (*cursor != '\0' && isspace((unsigned char)*cursor)) {
        cursor++;
    }
    return *cursor != '\0';
}

bool jsonHoleString(const char* json, const char* key, char* ziel, size_t zielGroesse) {
    if (!json || !key || !ziel || zielGroesse == 0U) return false;

    char muster[48] = {0};
    snprintf(muster, sizeof(muster), "\"%s\"", key);
    const char* fund = strstr(json, muster);
    if (!fund) return false;

    const char* cursor = strchr(fund + strlen(muster), ':');
    if (!cursor) return false;
    cursor++;
    if (!skipWhitespace(cursor) || *cursor != '"') return false;
    cursor++;

    const char* ende = strchr(cursor, '"');
    if (!ende) return false;

    size_t len = (size_t)(ende - cursor);
    if (len >= zielGroesse) len = zielGroesse - 1U;
    memcpy(ziel, cursor, len);
    ziel[len] = '\0';
    return true;
}

