DevOpsOfChaos/esp32-smart-home/firmware/src/master/main.cpp
bool jsonHoleBool(const char* json, const char* key, bool* wert) {
    if (!json || !key || !wert) return false;

    char muster[48] = {0};
    snprintf(muster, sizeof(muster), "\"%s\"", key);
    const char* fund = strstr(json, muster);
    if (!fund) return false;

    const char* cursor = strchr(fund + strlen(muster), ':');
    if (!cursor) return false;
    cursor++;
    if (!skipWhitespace(cursor)) return false;

    if (strncmp(cursor, "true", 4) == 0) {
        *wert = true;
        return true;
    }
    if (strncmp(cursor, "false", 5) == 0) {
        *wert = false;
        return true;
    }
    return false;
}

bool extrahiereNodeCommandTopic(const char* topic, char* nodeId, size_t nodeIdSize, bool* istSet, bool* istGet) {
    if (!topic || !nodeId || nodeIdSize == 0U || !istSet || !istGet) return false;

    const char* prefix = "smarthome/node/";
    const size_t prefixLen = strlen(prefix);
    if (strncmp(topic, prefix, prefixLen) != 0) return false;

    const char* start = topic + prefixLen;
    const char* slash = strchr(start, '/');
    if (!slash) return false;

    size_t len = (size_t)(slash - start);
    if (len == 0U || len >= nodeIdSize) return false;

    memcpy(nodeId, start, len);
    nodeId[len] = '\0';

    *istSet = strcmp(slash, "/cmd/set") == 0;
    *istGet = strcmp(slash, "/cmd/get") == 0;
    return *istSet || *istGet;
}

void verarbeiteHello(const uint8_t* senderMac, const SmartHome::HelloPayload& payload) {
    int nodeIndex = findeNodeIndex(payload.device_id);
    if (nodeIndex < 0) {
        logf("WARN", "HELLO ignoriert: unbekannte node_id=%s", payload.device_id);
        sendeHelloAck(senderMac, SH_ACK_REJECTED);
        return;
    }

    if (payload.device_class != NODE_DEFINITIONS[nodeIndex].device_class ||
        payload.power_type != NODE_DEFINITIONS[nodeIndex].power_type) {
        logf(
            "WARN",
            "HELLO abgelehnt: node=%s class=%u power=%u",
            payload.device_id,
            (unsigned)payload.device_class,
            (unsigned)payload.power_type);
        sendeHelloAck(senderMac, SH_ACK_REJECTED);
        return;
    }

    nodeStates[nodeIndex].meta_bekannt = true;
    nodeStates[nodeIndex].caps = holeHelloCaps(payload);
    nodeStates[nodeIndex].fw_version = payload.fw_version;
    copyText(nodeStates[nodeIndex].device_name, sizeof(nodeStates[nodeIndex].device_name), payload.device_name);

    aktualisiereNodeKontakt((size_t)nodeIndex, senderMac);
    publishNodeMeta((size_t)nodeIndex);
    publishNodeStatus((size_t)nodeIndex, true);
    sendeHelloAck(senderMac, SH_ACK_OK);

    logf("INFO", "HELLO von %s (%s)", payload.device_id, payload.device_name);
}

void verarbeiteHeartbeat(const uint8_t* senderMac, const SmartHome::HeartbeatPayload& payload) {
    int nodeIndex = findeNodeIndex(payload.node_id);
    if (nodeIndex < 0) {
        logf("WARN", "HEARTBEAT ignoriert: unbekannte node_id=%s", payload.node_id);
        return;
    }

    aktualisiereNodeKontakt((size_t)nodeIndex, senderMac);
    nodeStates[nodeIndex].uptime_s = payload.uptime_s;
    logf("INFO", "HEARTBEAT von %s (uptime=%lus)", payload.node_id, (unsigned long)payload.uptime_s);
}

void verarbeiteStateReport(const uint8_t* senderMac, const uint8_t* payload, uint16_t payloadLen) {
    if (!payload || payloadLen < SH_DEVICE_ID_LEN) {
        logf("WARN", "STATE_REPORT verworfen: payload ungueltig");
        return;
    }

    const char* nodeId = reinterpret_cast<const char*>(payload);
    int nodeIndex = findeNodeIndex(nodeId);
    if (nodeIndex < 0) {
        logf("WARN", "STATE_REPORT ignoriert: unbekannte node_id=%s", nodeId);
        return;
    }

    aktualisiereNodeKontakt((size_t)nodeIndex, senderMac);

    switch (NODE_DEFINITIONS[nodeIndex].device_class) {
        case SH_CLASS_NET_ERL:
            if (payloadLen != sizeof(SmartHome::StateReportPayload)) {
                logf("WARN", "STATE_REPORT Laenge ungueltig fuer %s", nodeId);
                return;
            }
            {
                const SmartHome::StateReportPayload& state = *reinterpret_cast<const SmartHome::StateReportPayload*>(payload);
                nodeStates[nodeIndex].relay_1 = (state.relay_1 != 0U);
                nodeStates[nodeIndex].fault = (state.fault != 0U);
            }
            break;

        case SH_CLASS_NET_ZRL:
            if (payloadLen != sizeof(SmartHome::ZrlStateReportPayload)) {
                logf("WARN", "STATE_REPORT Laenge ungueltig fuer %s", nodeId);
                return;
            }
            {
                const SmartHome::ZrlStateReportPayload& state = *reinterpret_cast<const SmartHome::ZrlStateReportPayload*>(payload);
                nodeStates[nodeIndex].relay_1 = (state.relay_1 != 0U);
                nodeStates[nodeIndex].relay_2 = (state.relay_2 != 0U);
                nodeStates[nodeIndex].cover_mode = (state.cover_mode != 0U);
                nodeStates[nodeIndex].cover_state = state.cover_state;
                nodeStates[nodeIndex].cover_position = state.cover_position;
                nodeStates[nodeIndex].fault = (state.fault != 0U);
            }
            break;

        case SH_CLASS_NET_SEN:
            if (payloadLen != sizeof(SmartHome::SensorStateReportPayload)) {
                logf("WARN", "STATE_REPORT Laenge ungueltig fuer %s", nodeId);
                return;
            }
            {
                const SmartHome::SensorStateReportPayload& state = *reinterpret_cast<const SmartHome::SensorStateReportPayload*>(payload);
                nodeStates[nodeIndex].temp_01c = state.temp_01c;
                nodeStates[nodeIndex].hum_01pct = state.hum_01pct;
                nodeStates[nodeIndex].lux = state.lux;
                nodeStates[nodeIndex].motion = (state.motion != 0U);
                nodeStates[nodeIndex].fault = (state.fault != 0U);
            }
            break;

        case SH_CLASS_BAT_SEN:
            if (payloadLen != sizeof(SmartHome::BatteryStateReportPayload)) {
                logf("WARN", "STATE_REPORT Laenge ungueltig fuer %s", nodeId);
                return;
            }
            {
                const SmartHome::BatteryStateReportPayload& state = *reinterpret_cast<const SmartHome::BatteryStateReportPayload*>(payload);
                nodeStates[nodeIndex].battery_pct = state.battery_pct;
                nodeStates[nodeIndex].battery_mv = state.battery_mv;
                nodeStates[nodeIndex].window_open = state.window_open;
                nodeStates[nodeIndex].rain_raw = state.rain_raw;
                nodeStates[nodeIndex].button_flags = state.button_flags;
                nodeStates[nodeIndex].fault = (state.fault != 0U);
            }
            break;

        default:
            logf("WARN", "STATE_REPORT ohne Handler fuer %s", nodeId);
            return;
    }

    nodeStates[nodeIndex].state_bekannt = true;
    publishNodeState((size_t)nodeIndex);
    logf("INFO", "STATE_REPORT von %s verarbeitet", nodeId);
}

void verarbeiteEventReport(const uint8_t* senderMac, const SmartHome::EventReportPayload& payload) {
    int nodeIndex = findeNodeIndex(payload.node_id);
    if (nodeIndex < 0) {
        logf("WARN", "EVENT ignoriert: unbekannte node_id=%s", payload.node_id);
        return;
    }

    aktualisiereNodeKontakt((size_t)nodeIndex, senderMac);
    publishNodeEvent((size_t)nodeIndex, payload);
    logf("INFO", "EVENT von %s: type=%u", payload.node_id, (unsigned)payload.event_type);
}

