DevOpsOfChaos/esp32-smart-home/firmware/src/master/main.cpp
void verarbeiteEspNowPaket(const uint8_t* senderMac, const uint8_t* daten, int laenge) {
    if (!senderMac || !daten || laenge < (int)sizeof(SmartHome::MsgHeader)) {
        logf("WARN", "ESP-NOW Paket verworfen: ungueltige Eingabe");
        return;
    }

    if (!SmartHome::hasValidPacketCrc(daten, (size_t)laenge)) {
        logf("WARN", "ESP-NOW Paket verworfen: CRC/Header ungueltig");
        return;
    }

    const SmartHome::MsgHeader* header = reinterpret_cast<const SmartHome::MsgHeader*>(daten);
    const uint8_t* payload = daten + SH_HEADER_SIZE;

    switch (header->msg_type) {
        case SH_MSG_HELLO:
            if (header->payload_len == sizeof(SmartHome::HelloPayload)) {
                verarbeiteHello(senderMac, *reinterpret_cast<const SmartHome::HelloPayload*>(payload));
            }
            break;

        case SH_MSG_HEARTBEAT:
            if (header->payload_len == sizeof(SmartHome::HeartbeatPayload)) {
                verarbeiteHeartbeat(senderMac, *reinterpret_cast<const SmartHome::HeartbeatPayload*>(payload));
            }
            break;

        case SH_MSG_STATE:
            verarbeiteStateReport(senderMac, payload, header->payload_len);
            break;

        case SH_MSG_EVENT:
            if (header->payload_len == sizeof(SmartHome::EventReportPayload)) {
                verarbeiteEventReport(senderMac, *reinterpret_cast<const SmartHome::EventReportPayload*>(payload));
            }
            break;

        default:
            logf("WARN", "ESP-NOW Nachricht ignoriert (msg_type=%u)", header->msg_type);
            break;
    }
}

#if ESP_ARDUINO_VERSION_MAJOR >= 3
void onEspNowReceive(const esp_now_recv_info_t* info, const uint8_t* daten, int laenge) {
    if (info == nullptr) return;
    verarbeiteEspNowPaket(info->src_addr, daten, laenge);
}
#else
void onEspNowReceive(const uint8_t* senderMac, const uint8_t* daten, int laenge) {
    verarbeiteEspNowPaket(senderMac, daten, laenge);
}
#endif

void onEspNowSent(const uint8_t* mac, esp_now_send_status_t status) {
    char text[18] = {0};
    macText(mac, text, sizeof(text));
    logf(
        status == ESP_NOW_SEND_SUCCESS ? "INFO" : "WARN",
        "ESP-NOW Sendestatus an %s: %s",
        text,
        status == ESP_NOW_SEND_SUCCESS ? "OK" : "FEHLER");
}

bool sendeStateRequest(size_t nodeIndex) {
    if (!nodeStates[nodeIndex].mac_bekannt) {
        logf("WARN", "STATE_REQUEST verworfen: MAC fuer %s unbekannt", NODE_DEFINITIONS[nodeIndex].node_id);
        return false;
    }

    SmartHome::CmdPayload payload = {};
    payload.cmd_type = SH_CMD_STATE_REQUEST;
    return sendePaket(nodeStates[nodeIndex].mac, SH_MSG_CMD, &payload, sizeof(payload), "STATE_REQUEST");
}

bool sendeRelayCommand(size_t nodeIndex, uint8_t relayIndex, bool relayState) {
    if (!nodeStates[nodeIndex].mac_bekannt) {
        logf("WARN", "COMMAND_SET_RELAY verworfen: MAC fuer %s unbekannt", NODE_DEFINITIONS[nodeIndex].node_id);
        return false;
    }

    SmartHome::CmdPayload payload = {};
    payload.cmd_type = SH_CMD_SET_RELAY;
    payload.param1 = relayIndex;
    payload.param2 = relayState ? 1U : 0U;
    return sendePaket(nodeStates[nodeIndex].mac, SH_MSG_CMD, &payload, sizeof(payload), "COMMAND_SET_RELAY");
}

void mqttCallback(char* topic, byte* payload, unsigned int length) {
    char json[256] = {0};
    size_t copyLen = length;
    if (copyLen >= sizeof(json)) copyLen = sizeof(json) - 1U;
    memcpy(json, payload, copyLen);
    json[copyLen] = '\0';

    char nodeId[SH_DEVICE_ID_LEN] = {0};
    bool istSet = false;
    bool istGet = false;
    if (!extrahiereNodeCommandTopic(topic, nodeId, sizeof(nodeId), &istSet, &istGet)) {
        logf("WARN", "MQTT Topic ignoriert: %s", topic);
        return;
    }

    int nodeIndex = findeNodeIndex(nodeId);
    if (nodeIndex < 0) {
        logf("WARN", "MQTT Command fuer unbekannte node_id=%s", nodeId);
        return;
    }

    logf("INFO", "MQTT empfangen %s -> %s", topic, json);

    char cmd[32] = {0};
    jsonHoleString(json, "cmd", cmd, sizeof(cmd));

    if (istGet) {
        if (strcmp(cmd, "state") != 0 && strcmp(cmd, "get_state") != 0) {
            logf("WARN", "MQTT cmd/get ignoriert fuer %s", nodeId);
            return;
        }

        sendeStateRequest((size_t)nodeIndex);
        return;
    }

    if (!istRelayNode((size_t)nodeIndex)) {
        logf("WARN", "MQTT set_relay ignoriert: %s ist kein Relais-Node", nodeId);
        return;
    }

    if (strcmp(cmd, "set_relay") != 0) {
        logf("WARN", "MQTT cmd/set ignoriert fuer %s", nodeId);
        return;
    }

    bool relayState = false;
    if (jsonHoleBool(json, "relay_1", &relayState)) {
        sendeRelayCommand((size_t)nodeIndex, 0U, relayState);
        return;
    }

    if (NODE_DEFINITIONS[nodeIndex].device_class == SH_CLASS_NET_ZRL &&
        jsonHoleBool(json, "relay_2", &relayState)) {
        sendeRelayCommand((size_t)nodeIndex, 1U, relayState);
        return;
    }

    logf("WARN", "MQTT set_relay ohne unterstuetzten Kanal fuer %s", nodeId);
}

void initialisiereHardware() {
    if (PIN_STATUS_LED >= 0) {
        pinMode(PIN_STATUS_LED, OUTPUT);
        digitalWrite(PIN_STATUS_LED, LOW);
    }
}

void initialisiereWlan() {
    WiFi.mode(WIFI_STA);
    WiFi.setSleep(false);
    WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
    masterStatus.letzter_wlan_versuch_ms = millis();
    logf("INFO", "WLAN-Verbindung gestartet: SSID=%s", WIFI_SSID);
}

void pruefeWlanVerbindung() {
    bool verbunden = (WiFi.status() == WL_CONNECTED);
    if (verbunden != masterStatus.wlan_verbunden) {
        masterStatus.wlan_verbunden = verbunden;
        if (verbunden) {
            logf("INFO", "WLAN verbunden: IP=%s Kanal=%d", WiFi.localIP().toString().c_str(), WiFi.channel());
        } else {
            logf("WARN", "WLAN getrennt");
        }
    }

    if (!verbunden && (millis() - masterStatus.letzter_wlan_versuch_ms) >= WIFI_RECONNECT_INTERVAL_MS) {
        WiFi.disconnect();
        WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
        masterStatus.letzter_wlan_versuch_ms = millis();
        logf("INFO", "WLAN-Reconnect gestartet");
    }
}

void initialisiereEspNow() {
    if (!masterStatus.wlan_verbunden) {
        esp_wifi_set_channel((uint8_t)WLAN_KANAL, WIFI_SECOND_CHAN_NONE);
    }

